vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1062X_DFP.pdsc
    <condition id="device.MIMXRT1062X_AND_CMSIS_Include_core_cm">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="armclang_OR_iar">
      <accept Tcompiler="ARMCC"/>
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND__armclang_OR_iar__AND_device.MIMXRT1062X_system">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062X_system"/>
      <require condition="armclang_OR_iar"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_device.MIMXRT1062X_CMSIS">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062X_header"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_CMSIS_Driver_Include.Ethernet_AND_CMSIS_Driver_Include.Ethernet_MAC_AND_CMSIS_Driver_Include.Ethernet_PHY_AND_RTE_Device_AND_driver.enet_AND_driver.phy-common">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Csub="Custom" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="Custom" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Csub="Custom" Capiversion="2.1.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpi2c_AND_driver.lpi2c_edma">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Csub="Custom" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.lpspi_AND_driver.lpspi_edma">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Csub="Custom" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_AND_driver.lpuart_edma">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Csub="Custom" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_device.MIMXRT1062X_CMSIS_AND_driver.clock">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062X_header"/>
    </condition>
    <condition id="core_type.cm7f">
      <require Dcore="Cortex-M7" Dfpu="DP_FPU"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.cache_armv7_m7_AND_driver.common">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.common_AND_driver.dmamux">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexcan">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.flexio">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexio_camera">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_camera"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexio_i2s">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexio_mculcd">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexio_spi">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexio_uart">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.common_AND_driver.soc_flexram_allocate">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate"/>
    </condition>
    <condition id="device.MIMXRT1062X_AND_driver.edma_AND_driver.flexspi">
      <require condition="device.MIMXRT1062X"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
