vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1062X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit_time_stamp_adapter" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.common_AND_driver.pit">
      <description>Component pit time stamp adapter; {for-development:SDK-Manifest-ID: component.pit_time_stamp_adapter.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/time_stamp/fsl_adapter_time_stamp.h"/>
        <file category="sourceC" name="components/time_stamp/fsl_adapter_pit_time_stamp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.1" condition="device.MIMXRT1062X_AND__component.serial_manager_spi_OR_component.serial_manager_swo_OR_component.serial_manager_uart_OR_component.serial_manager_virtual__AND_component.lists_AND_driver.common">
      <description>Component serial_manager; {for-development:SDK-Manifest-ID: component.serial_manager.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_manager.h"/>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_internal.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_component.lpspi_adapter_AND_component.serial_manager_AND_driver.lpspi">
      <description>Component serial_manager_spi; {for-development:SDK-Manifest-ID: component.serial_manager_spi.MIMXRT1062X}</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SPI
#define SERIAL_PORT_TYPE_SPI 1
#endif
#ifndef SERIAL_PORT_TYPE_SPI_MASTER
#define SERIAL_PORT_TYPE_SPI_MASTER 1
#endif
#ifndef SERIAL_PORT_TYPE_SPI_SLAVE
#define SERIAL_PORT_TYPE_SPI_SLAVE 1
#endif
#ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
#define SERIAL_MANAGER_NON_BLOCKING_MODE 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_spi.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_component.serial_manager_AND_core_type.cm7f_AND_driver.common">
      <description>Component serial_manager_swo; {for-development:SDK-Manifest-ID: component.serial_manager_swo.MIMXRT1062X}</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_swo.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_swo.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_component.lpuart_adapter_AND_component.serial_manager_AND_driver.lpuart">
      <description>Component serial_manager_uart; {for-development:SDK-Manifest-ID: component.serial_manager_uart.MIMXRT1062X}</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_uart.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_uart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_component.serial_manager_AND_driver.common">
      <description>Component serial_manager_virtual; {for-development:SDK-Manifest-ID: component.serial_manager_virtual.MIMXRT1062X}</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_VIRTUAL
#define SERIAL_PORT_TYPE_VIRTUAL 1
#endif
#ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
#define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/serial_manager/fsl_component_serial_port_virtual.h"/>
        <file category="sourceC" name="components/serial_manager/fsl_component_serial_port_virtual.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>Component software_crc_adapter; {for-development:SDK-Manifest-ID: component.software_crc_adapter.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>Component software_rng_adapter; {for-development:SDK-Manifest-ID: component.software_rng_adapter.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h"/>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="device.MIMXRT1062X_AND__component.gpt_adapter_OR_component.pit_adapter__AND_component.lists_AND_driver.common">
      <description>Component timer_manager; {for-development:SDK-Manifest-ID: component.timer_manager.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.common_AND_driver.trng">
      <description>Component trng_adapter; {for-development:SDK-Manifest-ID: component.trng_adapter.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h"/>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062X_header" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_CMSIS_Include_core_cm">
      <description>Device MIMXRT1062X_cmsis; {for-development:SDK-Manifest-ID: device.MIMXRT1062X_CMSIS.MIMXRT1062X}</description>
      <files>
        <file category="header" name="fsl_device_registers.h"/>
        <file category="header" name="MIMXRT1062X.h"/>
        <file category="header" name="MIMXRT1062X_features.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="device.MIMXRT1062X_AND__armclang_OR_iar__AND_device.MIMXRT1062X_system">
      <description>Device MIMXRT1062X_startup; {for-development:SDK-Manifest-ID: device.MIMXRT1062X_startup.MIMXRT1062X}</description>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MIMXRT1062X.s" version="1.1.0"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MIMXRT1062X.S" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1062Xxxxxx_flexspi_nor.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1062Xxxxxx_flexspi_nor_sdram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1062Xxxxxx_ram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1062Xxxxxx_sdram.scf" version="1.1.0"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1062Xxxxxx_sdram_txt.scf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1062Xxxxxx_flexspi_nor.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1062Xxxxxx_flexspi_nor_sdram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1062Xxxxxx_ram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1062Xxxxxx_sdram.icf" version="1.1.0"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1062Xxxxxx_sdram_txt.icf" version="1.1.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1062X_system" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_device.MIMXRT1062X_CMSIS">
      <description>Device MIMXRT1062X_system; {for-development:SDK-Manifest-ID: device.MIMXRT1062X_system.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="system_MIMXRT1062X.c"/>
        <file category="header" name="system_MIMXRT1062X.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.4" condition="device.MIMXRT1062X_AND_driver.common">
      <description>ADC Driver; {for-development:SDK-Manifest-ID: platform.drivers.adc_12b1msps_sar.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.2.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>ADC_ETC Driver; {for-development:SDK-Manifest-ID: platform.drivers.adc_etc.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc_etc.c"/>
        <file category="header" name="drivers/fsl_adc_etc.h"/>
      </files>
    </component>
