vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1062X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aipstz" Cversion="2.0.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>aipstz Driver; {for-development:SDK-Manifest-ID: platform.drivers.aipstz.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_aipstz.c"/>
        <file category="header" name="drivers/fsl_aipstz.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>AOI Driver; {for-development:SDK-Manifest-ID: platform.drivers.aoi.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_aoi.h"/>
        <file category="sourceC" name="drivers/fsl_aoi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bee" Cversion="2.0.2" condition="device.MIMXRT1062X_AND_driver.common">
      <description>BEE Driver; {for-development:SDK-Manifest-ID: platform.drivers.bee.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_bee.c"/>
        <file category="header" name="drivers/fsl_bee.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.4" condition="device.MIMXRT1062X_AND_driver.common">
      <description>CACHE Driver; {for-development:SDK-Manifest-ID: platform.drivers.cache_armv7_m7.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cache.c"/>
        <file category="header" name="drivers/fsl_cache.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.4.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>Clock Driver; {for-development:SDK-Manifest-ID: platform.drivers.clock.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.2" condition="device.MIMXRT1062X_AND_driver.common">
      <description>CMP Driver; {for-development:SDK-Manifest-ID: platform.drivers.cmp.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet" Csub="enet_cmsis" Cversion="2.2.0" Capiversion="2.1.0" condition="device.MIMXRT1062X_AND_CMSIS_Driver_Include.Ethernet_AND_CMSIS_Driver_Include.Ethernet_MAC_AND_CMSIS_Driver_Include.Ethernet_PHY_AND_RTE_Device_AND_driver.enet_AND_driver.phy-common">
      <description>ENET CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.enet_cmsis.MIMXRT1062X}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_enet_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_enet_cmsis.c"/>
        <file category="sourceC" name="cmsis_drivers/fsl_enet_phy_cmsis.c"/>
        <file category="header" name="cmsis_drivers/fsl_enet_phy_cmsis.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.1.0" Capiversion="2.3.0" condition="device.MIMXRT1062X_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpi2c_AND_driver.lpi2c_edma">
      <description>LPI2C CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpi2c_cmsis.MIMXRT1062X}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpi2c_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpi2c_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.4.0" Capiversion="2.2.0" condition="device.MIMXRT1062X_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.lpspi_AND_driver.lpspi_edma">
      <description>LPSPI CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpspi_cmsis.MIMXRT1062X}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpspi_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpspi_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="device.MIMXRT1062X_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_AND_driver.lpuart_edma">
      <description>LPUART CMSIS Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpuart_cmsis.MIMXRT1062X}</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_lpuart_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_lpuart_cmsis.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.3.1" condition="device.MIMXRT1062X_AND_device.MIMXRT1062X_CMSIS_AND_driver.clock">
      <description>COMMON Driver; {for-development:SDK-Manifest-ID: platform.drivers.common.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
        <file condition="core_type.cm7f" category="sourceC" name="drivers/fsl_common_arm.c"/>
        <file condition="core_type.cm7f" category="header" name="drivers/fsl_common_arm.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="csi" Cversion="2.1.5" condition="device.MIMXRT1062X_AND_driver.common">
      <description>CSI Driver; {for-development:SDK-Manifest-ID: platform.drivers.csi.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_csi.c"/>
        <file category="header" name="drivers/fsl_csi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_1" Cversion="2.3.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>DCDC Driver; {for-development:SDK-Manifest-ID: platform.drivers.dcdc_1.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dcdc.c"/>
        <file category="header" name="drivers/fsl_dcdc.h"/>
      </files>
    </component>
