vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1062X_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.3.0" condition="device.MIMXRT1062X_AND_driver.edma_AND_driver.lpi2c">
      <description>LPI2C Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpi2c_edma.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lpi2c_edma.c"/>
        <file category="header" name="drivers/fsl_lpi2c_edma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.2.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>LPSPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpspi.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lpspi.c"/>
        <file category="header" name="drivers/fsl_lpspi.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.0.5" condition="device.MIMXRT1062X_AND_driver.edma_AND_driver.lpspi">
      <description>LPSPI Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpspi_edma.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpspi_edma.h"/>
        <file category="sourceC" name="drivers/fsl_lpspi_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.5.2" condition="device.MIMXRT1062X_AND_driver.common">
      <description>LPUART Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpuart.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpuart.h"/>
        <file category="sourceC" name="drivers/fsl_lpuart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.5.2" condition="device.MIMXRT1062X_AND_driver.edma_AND_driver.lpuart">
      <description>LPUART Driver; {for-development:SDK-Manifest-ID: platform.drivers.lpuart_edma.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_lpuart_edma.h"/>
        <file category="sourceC" name="drivers/fsl_lpuart_edma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mdio-common" Cversion="2.0.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>Driver mdio-common; {for-development:SDK-Manifest-ID: driver.mdio-common.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/phy/fsl_mdio.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common" Cversion="1.0.0" condition="device.MIMXRT1062X">
      <description>Driver nand_flash-common; {for-development:SDK-Manifest-ID: driver.nand_flash-common.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/flash/nand/fsl_nand_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-controller-flexspi" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.flexspi_AND_driver.nand_flash-common">
      <description>Driver nand_flash-controller-flexspi; {for-development:SDK-Manifest-ID: driver.nand_flash-controller-flexspi.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="components/flash/nand/flexspi/fsl_flexspi_nand_flash.c"/>
        <file category="header" name="components/flash/nand/flexspi/fsl_flexspi_nand_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-controller-semc" Cversion="1.0.0" condition="device.MIMXRT1062X_AND_driver.nand_flash-common_AND_driver.semc">
      <description>Driver nand_flash-controller-semc; {for-development:SDK-Manifest-ID: driver.nand_flash-controller-semc.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="components/flash/nand/semc/fsl_semc_nand_flash.c"/>
        <file category="header" name="components/flash/nand/semc/fsl_semc_nand_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nic301" Cversion="2.0.0" condition="device.MIMXRT1062X_AND_driver.common">
      <description>NIC301 Driver; {for-development:SDK-Manifest-ID: platform.drivers.nic301.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_nic301.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.1.3" condition="device.MIMXRT1062X_AND_driver.common">
      <description>OCOTP Driver; {for-development:SDK-Manifest-ID: platform.drivers.ocotp.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_ocotp.h"/>
        <file category="sourceC" name="drivers/fsl_ocotp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common" Cversion="2.0.0" condition="device.MIMXRT1062X_AND_driver.mdio-common">
      <description>Driver phy-common; {for-development:SDK-Manifest-ID: driver.phy-common.MIMXRT1062X}</description>
      <files>
        <file category="header" name="components/phy/fsl_phy.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.0.4" condition="device.MIMXRT1062X_AND_driver.common">
      <description>PIT Driver; {for-development:SDK-Manifest-ID: platform.drivers.pit.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pit.c"/>
        <file category="header" name="drivers/fsl_pit.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu" Cversion="2.1.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>pmu Driver; {for-development:SDK-Manifest-ID: platform.drivers.pmu.MIMXRT1062X}</description>
      <files>
        <file category="header" name="drivers/fsl_pmu.h"/>
        <file category="sourceC" name="drivers/fsl_pmu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.2.1" condition="device.MIMXRT1062X_AND_driver.common">
      <description>PWM Driver; {for-development:SDK-Manifest-ID: platform.drivers.pwm.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pwm.c"/>
        <file category="header" name="drivers/fsl_pwm.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pxp" Cversion="2.2.2" condition="device.MIMXRT1062X_AND_driver.common">
      <description>PXP Driver; {for-development:SDK-Manifest-ID: platform.drivers.pxp.MIMXRT1062X}</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pxp.c"/>
        <file category="header" name="drivers/fsl_pxp.h"/>
      </files>
    </component>
